#Строковые типы данных - неизменяемые типы (значение изначальной переменной не изменится)

#Примечания:

#1 Чтобы заменить элемент строки на другой нужно (долгий и костыльный способ, есть метод replace для этого):
# - переформатировать строку в список
# - с помощью среза заменить элементы
# - с помощью метода join сделать строку не отдельными элементами, а просто в читаемом виде вывести. Пример:
                                                                                        #' '.join(my_list)
#2. Метод join работает только со строковыми типами данных и только
#3 - Преобраовать строку и int можно только если в строке есть цифры и только, иначе будет ошибка

